{
    "name": "Lorenzo Carlesso",
    "profession": "Senior Software Developer",
    "live": "I currently live in <b>Turin (Italy)</b>",
    "shortDescription": "Specialized in web projects.",
    "longDescription": "Programming and technologies continue to fascinate me.<br />Always ready to learn and mettermi in gioco.<br />L'entusiasmo non mi manca.",
    "quotes": [
        {
            "mention": "You have to die a few times before you can really live",
            "author": "Charles Bukowski"
        },
        {
            "mention": "Festìna lente",
            "author": "Augusto"
        }
    ],
    "news": [
        {
            "title": "2020",
            "content": [
                "I am always eager to learn new things about: Java 8 (and more recent versions), Scala, Akka, Spark, Javascript ES6, HTML5, CSS3, web frameworks(Vue.js, Bulma) and microservices architectures.",
                "I'm looking for new job opportunities related to realtime applications, streaming management, b2b services away from database but close to infrastracture for analysis, management, data presentation and monitoring.",
                "I am also available to gain experience in small or medium web projects."
            ]
        },
        {
            "title": "September 2019",
            "content": [
                "I've gone back to studying English to improve my speaking and writing skills.",
                "My next challenge is the Cambridge B2 certification, but at the moment I'm studying to achieve B1 level in May 2020."
            ]
        }
    ],
    "timeline": {
        "pauseForMyself": {
            "head": "September 2019 - April 2020",
            "modal": {
                "button": "Myself",
                "title": "Myself",
                "subtitle": "Manager of Training for Myself",
                "messages": [
                    "With my experience and due to ongoing changes in professional roles in the IT field, I'm taking a break to reflect on my career.",
                    "I want to consolidate previous knowledge before taking on new job opportunities with a enthusiasm.",
                    "I did many online courses to study in more detail the following: technologies, software development methodologies and software architectures.",
                    "I'm working on build several small projects in order to create my own portfolio."
                ]
            }
        },
        "xeffe": {
            "head": "September 2013",
            "modal": {
                "button": "Xeffe",
                "title": "Xeffe s.r.l. (Turin)",
                "subtitle": "Java/Scala Senior Developer - Team Leader",
                "messages": [
                    "-- Restart here --",
                    "Here, I had the opportunity to do much experience with the DDD software development.",
                    "I could use Scala language in a job context for the first time. Unfortunately I used it together Java, to support it, so I had not the possibility to have a deep experience with Scala to consolidate a strong experience.",
                    "I used other tools and techonolgies: Git, Gitlab, Maven, Play Framework, Spring, HighCart, REST, Json, ecc.",
                    "Work in this company for me has been a great experience also by the human view. Here I found a great pleasure to collaborate with many colleagues."
                ]
            }
        },
        "synthesis": {
            "head": "April 2008",
            "modal": {
                "button": "Synthesis",
                "title": "Synthesis (Turin)",
                "subtitle": "Java Senior Developer",
                "messages": [
                    "In this company, I had the opportunity to grow professionally both as developer and as IT worker.",
                    "I got to test myself following some projects inpendently on the whole software development cycle.",
                    "The company gave me the opportunity to interact directly with the customer."
                ]
            }
        },
        "datasoftRe": {
            "head": "January 2004",
            "modal": {
                "button": "Datasoft R.E.",
                "title": "Datasoft R.E. (Turin)",
                "subtitle": "Java Junior Developer",
                "messages": [
                    "On 2002 I went back to work. I started in this IT company.",
                    "Here I started with this technology stack: Oracle, Java(Swing, EJB2), Struts, HTML, Javascript, CSS.",
                    "With the passing years, I learned others technologies: Spring Framework ed Adobe Flex.",
                    "Con il passare degli anni vidi altre tecnologie come Spring Framework, Adobe Flex, CVS, ecc.",
                    "I did much programming experience and I became what I am still now: a FullStack developer."
                ]
            }
        },
        "dynamicSitesCourse": {
            "head": "2001",
            "modal": {
                "button": "Dynamic Sites",
                "title": "Dynamic Sites Course",
                "subtitle": "ASP - PHP - JAVA - Microsoft Access",
                "messages": [
                    "After few years, first HTML sites, home and business Internet connection started to diffuse. I started to rediscover interest for web technologies and programming.",
                    "I tried to make some HTML page just for pleasure and fun.",
                    "Soon after I left my job to start a one year course on ASP, PHP and Java. At the beginning of 2000 was common to say dinamyc site, not web applications yet.",
                    "Therefore I got the qualification of dynamic site programmer (the first FullStack developers)."
                ]
            }
        },
        "allStamp": {
            "head": "December 1997",
            "modal": {
                "button": "All Stamp",
                "title": "All Stamp s.r.l. (Turin)",
                "subtitle": "Technical Designer",
                "messages": [
                    "Programming fascinated me but It not convinced me a lot for to continue with the study or work.",
                    "So when I finished my high school I started straight to work like technical designer in a family business specializing on sheet metal blanking."
                ]
            }
        },
        "secondDaughter": {
            "head": "2010",
            "text": "My second daughter is born"
        },
        "firstDaughter": {
            "head": "2007",
            "text": "My first daughter is born"
        },
        "meetAlice": {
            "head": "May 2005",
            "text": "I met my wife Alice"
        },
        "youth": {
            "head": "1999",
            "modal": {
                "button": "Youth",
                "title": "Youth",
                "subtitle": "",
                "messages": [
                    "They were carefreee and pacefull years, where computers are not the central interest of my life but a toy like others though It consumed many hours of play.",
                    "I lived on suburbs of Turin. I had the possibility to have contact with nature and to pass much time with my friends.",
                    "So, I grew up giving space to my passions: football, music, holidays, adventures with my friends."
                ]
            }
        },
        "highSchool": {
            "head": "June 1997",
            "modal": {
                "button": "High School",
                "title": "Computer Expert Graduation",
                "subtitle": "I.T.I.S. E. Majoarana - Grugliasco (Turin)",
                "messages": [
                    "Here is where I wrote my first code in Turbo Pascal.",
                    "In this school I learned the real rudiments and the basics about programming:",
                    "make a flowchart (with paper and pen, argh), alghoritms (searching, sorting, binary trees, balanced trees, ecc.), data structures (trees, vectors, maps, matrix), file and databases concepts, etc."
                ]
            }
        },
        "playDrum": {
            "head": "1992",
            "text": "I started to play drum"
        },
        "playFootball": {
            "head": "1986",
            "text": "I started to play football"
        },
        "born": {
            "head": "1977",
            "text": "When I was born"
        },
        "commodore64": {
            "head": "1985",
            "modal": {
                "button": "C=64",
                "title": "Commodore 64",
                "subtitle": "Natale 1985",
                "messages": [
                    "For Christmas, my brothers and I received the legendary Commodore 64. It was in that moment where we discovered the fantastic programming world ...ehm no, no. That is the story of other many programmers. We simply knew the console world to play games.",
                    "Meanwhile computers continue to evolve, my brothers and I continued to evolve our abilities in videogames. Or We used print some banner, MC/DVD cover, with dot matrix printer or to use the first worksheet software (Lotus 1-2-3).",
                    "I that years was normal use the conosle to give oder to computer. So I learned naturally the first basic OS commands with MS-DOS: cd, dir, copy *.*, zip, unzip."
                ]
            }
        },
        "headerEnd": {
            "text": "..."
        },
        "twoThousand": {
            "text": "2000"
        },
        "headerStart": {
            "text": "1970"
        }
    },
    "skills": [
        {
            "title": "Technology",
            "list": [
                {
                    "title": "Java",
                    "messages": [
                        "I've used Java for 15 years. I started with J2EE 1.4.",
                        "It's impossible know the whole java world because it became a universe."
                    ]
                },
                {
                    "title": "Scala",
                    "messages": [
                        "I've started to use Scala four years ago.",
                        "I'm studying it to improve my confidence with it."
                    ]
                },
                {
                    "title": "Javascript",
                    "messages": [
                        "I've written Javascript code. I like use it. but I am not a Javascript ninja.",
                        "I am studying ES6 to upgrade my confidence and level."
                    ]
                },
                {
                    "title": "HTML5 - CSS3",
                    "messages": [
                        "Actually I'm not a web designer or a UX but I know how to use these technologies.",
                        "I've started to use SASS."
                    ]
                },
                {
                    "title": "Web Frameworks",
                    "messages": [
                        "I used Play Framework, Servlet with JSP/JSTL, Struts.",
                        "I've started to study Vue.js."
                    ]
                },
                {
                    "title": "Other",
                    "messages": [
                        "I used many others frameworks, tool, libraries, IDE. I list someone:",
                        "Spring Framework, Maven, Git, IntelliJ, VSCode."
                    ]
                }
            ]
        },
        {
            "title": "Software Engineering",
            "list": [
                {
                    "title": "Programming and coding",
                    "messages": [
                        "I used different programming languages, starting from PHP, ASP arriving to Javascript, Java and Scala.",
                        "I did not be stuck to object-oriented programming paradigm, even if that's what I used the most, but I started to school with procedural programming and today I am deeping the functional programming.",
                        "I use design pattern and modularization, abstraction and mantianabiliy deign concepts to solve my daily implementation issues."
                    ]
                },
                {
                    "title": "Development process",
                    "messages": [
                        "I started to work with a typical waterfall development process.",
                        "Later I had the opportunity to do experience with the Agile metodology in the forms of Kanban and Scrum."
                    ]
                },
                {
                    "title": "Software design",
                    "messages": [
                        "I used the MVC model as main architectural reference model. ",
                        "At the moment I'm discovering the potential of reactive systems linked to micreoservices architectures.",
                        "I had the opportunity to do experience on projects that exploited the ley concepts of Domain Driven Design."
                    ]
                }
            ]
        },
        {
            "title": "Soft Skill",
            "list": [
                {
                    "title": "Communication",
                    "messages": [
                        "I feel plesaure to sharing and listening with people that collaborate with me.",
                        "I try to be synthetic and efficient in communication to be clear and avoid misunderstanding."
                    ]
                },
                {
                    "title": "Teamwork",
                    "messages": [
                        "I do not like to work alone. I need to share the good and the bad of the job assuming a positive attitude, aimed at the success of the activity.",
                        "I work almost always in teams of few people."
                    ]
                },
                {
                    "title": "Adaptability",
                    "messages": [
                        "I improved my time and activityies management skills because I have done experiences on projects not so well organized and critical situations.",
                        "With my last experiences in small and medium companies, it was almost normal to take on roles not always of developer."
                    ]
                },
                {
                    "title": "Problem-Solving",
                    "messages": [
                        "I believe the better way to solve a problem is sharing. This offers the opportunity to have more ideas to find the effective solution and and helps to strengthen relationships between colleagues.",
                        "I try to adopt a standard method to increase one's independence in the face of problems: never stop studying. I think It's the best way to contain the dark side of each us: ignorance."
                    ]
                },
                {
                    "title": "Creativity",
                    "messages": [
                        "I am not particulary creative on an artistic level but I try to be creative in reasoning and observation to always find a logical scheme for the situations that I have to elaborate.",
                        "I use drugs to get creative ideas from other dimensions. I am joking. this happened for som musicians in the sixties...a no, It still happens today."
                    ]
                },
                {
                    "title": "Work Ethic",
                    "messages": [
                        "I try to always maintain a professional attitude in every area to be consistent and transparent towards others.",
                        "If I can I do not avoid a costructive criticism to solve or improve situations where they can create ecnomic damage or waste of time."
                    ]
                },
                {
                    "title": "Interpersonal Skills",
                    "messages": [
                        "If the context allows, I try to break the wall of formality to feel and make people around me feel at ease to create a relaxed atmosphere.",
                        "I believe that an environment with few conformisms allows people to open up by offering better communication and productivity."
                    ]
                },
                {
                    "title": "Leadership",
                    "messages": [
                        "In a right context and right conditions, I am able to lead small teams.",
                        "I always tried to help my colleague in difficulty. I offeres them technical help, moral and sharing support.",
                        "I tend to involve all the people who collaborate with me, asking me the problem of finding the right way to make them feel valued."
                    ]
                },
                {
                    "title": "Attention to Detail",
                    "messages": [
                        "Many people that know me define me observer, I am attention on detail continuously",
                        "I can't live much time in a disorganized context when I understand disorganization is the normality and not an exception."
                    ]
                }
            ]
        }
    ],
    "info": {
        "whyThisSite": {
            "title": "Why this site?",
            "description": "My intention is to give a friendly perspective about me."
        },
        "training": {
            "title": "Training",
            "description": "I've found good to build something useful to me and to make practice with some new technology."
        },
        "warning": {
            "title": "Warning",
            "description": "I forgot: I am not a web designer but I've tried to expose my contents in a pleasent way."
        }
    }
}