{
    "name": "Lorenzo Carlesso",
    "profession": "Sviluppatore Software Senior",
    "live": "Attualmente vivo a <b>Torino</b>",
    "shortDescription": "Specializzato in progetti web.",
    "longDescription": "Programmazione e tecnologie continuano ad affascinarmi.<br />Sempre pronto per imparare, e mettermi in gioco.<br />L'entusiasmo non mi manca.",
    "quotes": [
        {
            "mention": "Devi morire alcune volte prima di poter vivere veramente",
            "author": "Charles Bukowski"
        },
        {
            "mention": "Festìna lente",
            "author": "Augusto"
        }
    ],
    "news": [
        {
            "title": "2020",
            "content": [
                "In continua formazione su: Java 8 (e successive versioni), Scala, Akka, Spark, Javascript ES6, HTML5, CSS3, web frameworks(Vue.js, Bulma) e architetture a microservizi.",
                "Sto cercando opportunità legate ad applicazioni realtime, gestione dei flussi, servizi b2b non troppo vicini ai database ma più d'infrastruttura per analisi, gestione, esposizione e monitoraggio dati.",
                "Esperienze su progetti web medio piccoli non mi dispiacerebbero."
            ]
        },
        {
            "title": "Settembre 2019",
            "content": [
                "Ho ricominciato a studiare Inglese per migliorarmi nel parlato e nello scritto.",
                "Il mio obiettivo è la certificazione Cambridge B2, ma al momento sto studiando per ottenere la B1 a Maggio 2020."
            ]
        }
    ],
    "timeline": {
        "pauseForMyself": {
            "head": "Settembre 2019 - Today",
            "modal": {
                "button": "Myself",
                "title": "Myself",
                "subtitle": "Responsabile della formazione per Myself",
                "messages": [
                    "Con l'esperienza maturata e la continua diversificazione delle figure professionali del settore IT, ho sentito di dover prendere una pausa dal lavoro per fare alcune riflessioni e scelte professionali.",
                    "Ho voluto consolidare alcune conoscenze per poter ripartire con un nuovo entusiasmo verso opportunità che il mondo del lavoro potrebbe offrirmi.",
                    "Ho fatto e sto seguento diversi corsi online per consolidare ed approfondire tecnologie, metodologie di sviluppo ed architetture software.",
                    "Cerco di realizzare alcuni piccoli progetti con l'idea di realizzare un mio portfolio."
                ]
            }
        },
        "xeffe": {
            "head": "Settembre 2013",
            "modal": {
                "button": "Xeffe",
                "title": "Xeffe s.r.l. (Torino)",
                "subtitle": "Java/Scala Senior Developer - Team Leader",
                "messages": [
                    "In quest'azienda ho avuto modo di fare molta esperienza nell'approccio allo sviluppo software DDD.",
                    "Ho potuto utilizzare per la prima volta Scala, ma purtroppo solo come supporto a Java, perciò non ho potuto consolidare una profonda esperienza.",
                    "Alcuni altri strumenti e tecnologie utilizzati sono stati: Git, Gitlab, Maven, Play Framework, Spring, HighCart, REST, Json, ecc.",
                    "E' stata un'esperienza importante dal punto di vista umano. Qui ho conosciuto molti colleghi con cui ho avuto grandissimo piacere collaborare."
                ]
            }
        },
        "synthesis": {
            "head": "Aprile 2008",
            "modal": {
                "button": "Synthesis",
                "color": "is-secondary",
                "title": "Synthesis (Torino)",
                "subtitle": "Java Senior Developer",
                "messages": [
                    "Qui ho avuto la possibilità di crescere professionalmente sia come programmatore che come lavoratore.",
                    "Ho avuto modo di mettermi alla prova seguendo progetti in maniera indipendente nell'intero ciclo di realizzazione del software.",
                    "L'azienda mi ha dato possibilità d'interfacciarmi direttamente con il cliente."
                ]
            }
        },
        "datasoftRe": {
            "head": "Gennaio 2004",
            "modal": {
                "button": "Datasoft R.E.",
                "title": "Datasoft R.E. (Torino)",
                "subtitle": "Java Junior Developer",
                "messages": [
                    "Nel 2002 tornai a lavorare ed iniziai in quest'azienda informatica.",
                    "Qui lo stack tecnologico era: Oracle, Java(Swing, EJB2), Struts, HTML, Javascript, CSS.",
                    "Con il passare degli anni vidi altre tecnologie come Spring Framework ed Adobe Flex.",
                    "Feci molta esperienza di programmazione, e divenni quello che sono ancora ora: un FullStack developer."
                ]
            }
        },
        "dynamicSitesCourse": {
            "head": "2001",
            "modal": {
                "button": "Siti Dinamici",
                "title": "corso Siti dinamici",
                "subtitle": "ASP - PHP - JAVA - Microsoft Access",
                "messages": [
                    "Passati un po' di anni con la diffusione dei primi siti HTML, modem e connessioni Internet private, iniziai a riscoprire interesse per le tecnologie web e per la programmazione",
                    "Iniziai a fare qualche pagina HTML così per diletto.",
                    "Dopo poco lasciai il lavoro per fare un corso di un anno su ASP, PHP e Java. Agli inizi del 2000 si parlava di siti dinamici, non ancora di web application.",
                    "Perciò ottenni la qualifica come programmatore di siti dinamici (i primi fullstack developer)."
                ]
            }
        },
        "allStamp": {
            "head": "Dicembre 1997",
            "modal": {
                "button": "All Stamp",
                "title": "All Stamp s.r.l. (Turin)",
                "subtitle": "Technical Designer",
                "messages": [
                    "La programmazione mi aveva affascinato ma non convinto così tanto da continuare nello studio o nel lavoro.",
                    "Così finita la scuola superiore iniziai subito a lavorare come disegnatore tecnico per tranciatura lamiera nell'azienda di famiglia."
                ]
            }
        },
        "secondDaughter": {
            "head": "2010",
            "text": "E' nata la mia seconda figlia"
        },
        "firstDaughter": {
            "head": "2007",
            "text": "E' nata la mia prima figlia"
        },
        "meetAlice": {
            "head": "Maggio 2005",
            "text": "Ho incontrato Alice"
        },
        "youth": {
            "head": "1999",
            "modal": {
                "button": "Gioventù",
                "title": "Gioventù",
                "subtitle": "",
                "messages": [
                    "Erano anni molto spensierati e sereni, dove il computer non era centrale nella mia vita ma un giocattolo come gli altri anche se ha assorbito parecchie ore di gioco.",
                    "Abitavo nella periferia di Torino, con la possbilità di essere molto a contatto con la natura e passare tempo con gli amici.",
                    "Così crebbi dando spazio alle mie passioni: calcio, musica, vacanze, avventure con gli amici."
                ]
            }
        },
        "highSchool": {
            "head": "Giugno 1997",
            "modal": {
                "button": "Scuola Superiore",
                "title": "Computer Expert Graduation",
                "subtitle": "I.T.I.S. E. Majoarana - Grugliasco (Turin)",
                "messages": [
                    "Qui è dove ho scritto il mio primo codice con Turbo Pascal.",
                    "In questa scuola ho imparato i veri rudimenti della programmazione.",
                    "Fare un flowchart(con carta e penna, argh), i principali algoritmi di ordinamento, strutture dati(albero, vettori, mappe, matrici), il concetto di file e di database, etc."
                ]
            }
        },
        "playDrum": {
            "head": "1992",
            "text": "Iniziato a suonare la batteria"
        },
        "playFootball": {
            "head": "1986",
            "text": "Iniziato a giocare in una squadra di calcio"
        },
        "born": {
            "head": "1977",
            "text": "Quando sono nato"
        },
        "commodore64": {
            "head": "1985",
            "modal": {
                "button": "C=64",
                "title": "Commodore 64",
                "subtitle": "Natale 1985",
                "messages": [
                    "Io e i miei fratelli ricevemmo per Natale il Commodore 64. Fu li che scoprimmo il mondo della programmazione ...ehm no, no, quella è una storia di molti altri programmatori. Noi scoprimmo semplicemente il mondo delle console per giocare.",
                    "Mentre i computer continuavano ad evolvere, io e i miei fratelli continuavamo ad evolvere le nostre abilità nei videogiochi. Oppure a stampare qualche banner, copertina di MC o DVD con la stampante ad aghi o ad usare i primi software di fogli eletttonici (Lotus 1-2-3).",
                    "In quegli anni era normale dare istruzioni al computer da console, così con MS-DOS imparai con naturalezza i primi comandi base di un sistema operativo: cd, dir, copy *.* , zip, unzip."
                ]
            }
        },
        "headerEnd": {
            "text": "..."
        },
        "twoThousand": {
            "text": "2000"
        },
        "headerStart": {
            "text": "1970"
        }
    },
    "skills": [
        {
            "title": "Tecnologie",
            "list": [
                {
                    "title": "Java",
                    "messages": [
                        "Uso Java da oltre 15 anni. Ho iniziato con J2EE 1.4 ed EJB2.",
                        "E' impossibile conoscere l'intero mondo Java perchè è diventato un universo."
                    ]
                },
                {
                    "title": "Scala",
                    "messages": [
                        "Ho iniziato ad utilizzare Scala dal 2012.",
                        "Mi sono piaciuti subito i vantaggi della programmazione funzionale e le API evolute di Scala.",
                        "L'ho utilizzato principalmente di supporto ai progetti Java.",
                        "Mi è dispiaciuto non aver avuto fino ad ora esperienze più approfondite in ambito lavorativo.",
                        "Attualmente sto continuando a studiarlo per migliorare la mia confidenza con questo linguaggio."
                    ]
                },
                {
                    "title": "Javascript",
                    "messages": [
                        "Ho avuto modo di scrivere codice Javascript. Mi piace utilizzarlo ma non ho avuto possibilità di approfondire in ambito lavorativo.",
                        "Non sono un Javascript ninja ma sto continuando a studiarlo, in particolare ES6, per aumentarne il mio livello di capacità e sicurezza."
                    ]
                },
                {
                    "title": "HTML5 - CSS3",
                    "messages": [
                        "In sostanza non sono un web/UX deigner ma so come usare queste tecnologie.",
                        "Sto iniziando a conoscere le qualità di SASS e i vantaggi di alcuni CSS frameworks."
                    ]
                },
                {
                    "title": "Web Frameworks",
                    "messages": [
                        "Ho usato Play Framework, Servlet with JSP/JSTL, Struts.",
                        "Ho iniziato a studiare ed utilizzare Vue.js e Bulma per scopi personali."
                    ]
                },
                {
                    "title": "Altro",
                    "messages": [
                        "Ho usato molti altri frameworks, strumenti, librerie e IDE. Ne elenco alcuni:",
                        "Spring Framework, Maven, Git, IntelliJ, VSCode."
                    ]
                }
            ]
        },
        {
            "title": "Software Engineering",
            "list": [
                {
                    "title": "Programmazione e codice",
                    "messages": [
                        "Ho utilizzato linguaggi di vario tipo, partendo da PHP, ASP per arrivare a Javascript, Java e Scala.",
                        "Non sono rimasto fermo solo al paradigma di programmazione ad oggetti, anche è quello con cui ho lavorato di più, ma ho iniziato a scuola con il procedurale e oggi sto approfondendo quello funzionale.",
                        "Di fronte alle problematiche d'implementazione cerco di sfruttare i design pattern ed applicare i design concepts di modularizzazione, astrazione e maintainability."
                    ]
                },
                {
                    "title": "Processo di sviluppo",
                    "messages": [
                        "Ho iniziato a lavorare con il tipico processo Waterfall.",
                        "In seguito ho avuto modo di fare esperienze con la  metodologia di sviluppo Agile nelle forme di Kanban e Scrum."
                    ]
                },
                {
                    "title": "Software design",
                    "messages": [
                        "Ho utilizzato il modello MVC come principale modello di riferimento architetturale.",
                        "Attualmente sto scoprendo le potenzialità dei sistemi reattivi legati ad architetture a microservizi.",
                        "Ho avuto occasione di fare esperienza su progetti che sfruttavano i concetti chiave del Domain Driven Design."
                    ]
                }
            ]
        },
        {
            "title": "Soft Skill",
            "list": [
                {
                    "title": "Comunicazione",
                    "messages": [
                        "Provo piacere nel condividere e ascoltare le persone che collaborano con me.",
                        "Cerco di essere sintetico ed esplicito nella comunicazione per non dare spazio a incomprensioni."
                    ]
                },
                {
                    "title": "Lavoro in team",
                    "messages": [
                        "Non sono fatto per lavorare da solo. Ho bisogno di condividere il bene ed il male del lavoro assumendo un atteggiamento propositivo, finalizzato al successo delle attività.",
                        "Ho lavorato quasi sempre con team di poche persone."
                    ]
                },
                {
                    "title": "Adattabilità",
                    "messages": [
                        "Ho migliorato la capacità di gestione delle attività e del tempo grazie all'esperienza su alcuni progetti non ben organizzati e/o di situazioni di emergenza.",
                        "Avendo lavorato in aziende medio piccole era quasi la normalità dover assumere ruoli non sempre di solo sviluppatore."
                    ]
                },
                {
                    "title": "Problem-Solving",
                    "messages": [
                        "Credo che la soluzione migliore per affrontare e risolvere un problema sia la condivisione. Questo offre l'opportunità di avere più spunti per trovare la soluzione efficace e aiuta ad irrobustire le relazioni tra colleghi.",
                        "Cerco di adottare un metodo universale per aumentare la propria indipendenza di fronte ai problemi: non smettere mai di studiare. Ritengo sia il modo milgiore per contenere il lato oscuro di ognuno di noi: l'ignoranza. "
                    ]
                },
                {
                    "title": "Creatività",
                    "messages": [
                        "Non sono particolarmente creativo a livello artistico ma cerco di esserlo nel ragionamento e nell'osservazione per trovare sempre uno schema logico alle situazioni che devo elaborare.",
                        "Faccio uso di droghe per avere spunti creativi da altre dimensioni. Scherzo. Questo succedeva per alcuni musicisti negli anni sessanta...a no, succede ancora oggi."
                    ]
                },
                {
                    "title": "Etica del lavoro",
                    "messages": [
                        "Cerco di mantenere sempre un atteggiamento professionale in ogni ambito per risultare coerente e trasparente verso gli altri.",
                        "Se posso non evito la critica costruttiva per risolvere o migliorare situazioni che possano creare un danno economico o di dispersione di tempo."
                    ]
                },
                {
                    "title": "Abilità interpersonali",
                    "messages": [
                        "Se il contesto lo permette, cerco di rompere il muro della formalità per sentirmi e far sentire a proprio agio le persone che ho intorno per creare un clima rilassato e disteso.",
                        "Credo che un ambiente con pochi conformismi permetta alle persone di aprirsi offrendo una migliore comunicazione e produttività."
                    ]
                },
                {
                    "title": "Leadership",
                    "messages": [
                        "Nel giusto contesto e nelle giuste condizioni, sono in grado di condurre piccoli team.",
                        "Ho sempre cercato di aiutare colleghi in difficoltà offrendo l'aiuto tecnico, supporto morale e la condivisione.",
                        "Tendo a coinvolgere tutte le persone che collaborano con me ponendomi il problema di trovare il modo giusto per farle sentire valorizzate."
                    ]
                },
                {
                    "title": "Attenzione al dettaglio",
                    "messages": [
                        "Molte persone che mi conoscono mi definiscono osservatore, perciò sono continuamente attento al dettaglio.",
                        "Non riesco a convivere per troppo tempo in un ambiente troppo disorganizzato nel momento in cui percepisco che non è un'eccezione ma la normalità."
                    ]
                }
            ]
        }
    ],
    "info": {
        "whyThisSite": {
            "title": "Perchè questo sito?",
            "description": "L'intenzione è fornire una prospettiva amichevole di me stesso, non troppo formale e schematica."
        },
        "training": {
            "title": "Allenamento",
            "description": "Credo che fare pratica per consolidare o conoscere nuove tecnologie senza dover seguire le stringenti dinamiche di un contesto di lavoro, sia molto formativo."
        },
        "warning": {
            "title": "Attenzione",
            "description": "Dimenticavo: non sono un web designer. Ho provato a esporre i miei contenuti in un modo piacevole."
        }
    }
}